js-stock-backend/app/controllers/stocks_controller.rb

SELECT "stocks".* FROM "stocks"
---
    def index
        stocks = Stock.all

SELECT "stocks".* FROM "stocks" WHERE "stocks"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def show
        stock = Stock.find_by(id: params[:id])

INSERT INTO "stocks" ("ticker", "company", "current_price", "shares", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["ticker", "A"], ["company", "Apple"], ["current_price", "146.0"], ["shares", 0], ["user_id", 17], ["created_at", "2020-09-05 02:27:22.421326"], ["updated_at", "2020-09-05 02:27:22.421326"]]
---
    def create
        stock = Stock.create(ticker: params[:ticker], company: params[:company], current_price: params[:current_price], shares: params[:shares], market_value: params[:market_value], user_id: params[:user_id])

SELECT "stocks".* FROM "stocks" WHERE "stocks"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "stocks" SET "shares" = $1, "market_value" = $2, "updated_at" = $3 WHERE "stocks"."id" = $4  [["shares", 2], ["market_value", "146.0292"], ["updated_at", "2020-09-04 12:25:29.887147"], ["id", 1]]
---
    def update
        stock = Stock.find_by(id: params[:id])
        stock.update(ticker: params[:ticker], company: params[:company], current_price: params[:current_price], shares: params[:shares], market_value: params[:market_value])

SELECT "stocks".* FROM "stocks" WHERE "stocks"."id" = $1 LIMIT $2  [["id", 8], ["LIMIT", 1]]
DELETE FROM "stocks" WHERE "stocks"."id" = $1  [["id", 8]]
---
    def destroy
        stock = Stock.find_by(id: params[:id])
        stock.destroy