js-stock-backend/app/controllers/stocklistings_controller.rb

    def index
        stocklistings = Stocklisting.all
---
SELECT "stocklistings".* FROM "stocklistings"