js-stock-backend/app/controllers/users_controller.rb

INSERT INTO "users" ("username", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["username", "[object HTMLInputElement]"], ["created_at", "2020-09-01 07:25:36.221096"], ["updated_at", "2020-09-01 07:25:36.221096"]]
---
    def create
       user = User.create(username: params[:username])